---
kind: method
id: M:Autodesk.Revit.DB.View3D.GetSavedOrientation
zh: 三维视图、3d视图
source: html/68d4a6b9-79f1-8b7e-704d-a3bfe6329e70.htm
---
# Autodesk.Revit.DB.View3D.GetSavedOrientation Method

**中文**: 三维视图、3d视图

Gets the saved orientation of the View3D.

## Syntax (C#)
```csharp
public ViewOrientation3D GetSavedOrientation()
```

## Returns
The saved orientation of the View3D.